{
  "_id": {
    "$oid": "5d86f856d62e132d70a5d3ac"
  },
  "title": "Some stuff about the MCU - The Marvel Cinematic Universe",
  "author": {
    "$oid": "5d86f82ed62e132d70a5d3ab"
  },
  "content": "The Marvel Cinematic Universe (MCU) is an American media franchise and shared universe centered on a series of superhero films, independently produced by Marvel Studios and based on characters that appear in American comic books published by Marvel Comics. The franchise also includes comic books, short films, television series, and digital series. The shared universe, much like the original Marvel Universe in comic books, was established by crossing over common plot elements, settings, cast, and characters.\r\rThe first MCU film was Iron Man (2008), which began the first phase of films culminating in the crossover film The Avengers (2012). Phase Two began with Iron Man 3 (2013) and concluded with Ant-Man (2015). Phase Three began with Captain America: Civil War (2016) and concluded with Spider-Man: Far From Home (2019). The first three phases in the franchise are collectively known as 'The Infinity Saga'. Phase Four will begin with Black Widow (2020) and is set to conclude with Thor: Love and Thunder (2021).\r\rMarvel Television expanded the universe to network television with Marvel's Agents of S.H.I.E.L.D. on ABC in the 2013–14 television season, followed by online streaming with Marvel's Daredevil on Netflix in 2015 and Marvel's Runaways on Hulu in 2017, and then to cable television with Marvel's Cloak & Dagger on Freeform in 2018. Marvel Television also produced the digital series Marvel's Agents of S.H.I.E.L.D.: Slingshot. Marvel Studios also expanded to online streaming with Disney+ for tie-in shows, starting with The Falcon and the Winter Soldier in 2020. Soundtrack albums have been released for all the films and many of the television series, as well compilation albums containing existing music heard in the films. The MCU also includes tie-in comics published by Marvel Comics, while Marvel Studios has also produced a series of direct-to-video short films and a viral marketing campaign for its films and the universe with the faux news program WHIH Newsfront.\r\rThe franchise has been commercially successful and has generally received a positive critical response, though some reviewers have found that some of its films and television series have suffered in service of the wider universe. It has inspired other film and television studios with comic book character adaptation rights to attempt to create similar shared universes. The MCU has also been the focus of other media, outside of the shared universe, including attractions at various Walt Disney Parks and Resorts, an attraction at Discovery Times Square, a Queensland Gallery of Modern Art exhibit, two television specials, guidebooks for each film, multiple tie-in video games, and commercials.",
  "createdAt": {
    "$date": "2019-09-22T04:28:06.451Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T04:28:06.451Z"
  },
  "__v": 0
}
{
  "_id": {
    "$oid": "5d86f89fd62e132d70a5d3ae"
  },
  "title": "The Mission Impossible movies is one of the few film franchise that did not get worse overtime",
  "author": {
    "$oid": "5d86f882d62e132d70a5d3ad"
  },
  "content": "Mission: Impossible is a series of American action spy films both based on and a follow-on from the television series of the same name created by Bruce Geller. The series is co-produced by and stars Tom Cruise, whose character is Ethan Hunt, an agent of the Impossible Missions Force (IMF). Τhe original music for the movies has been written by Danny Elfman, Hans Zimmer, Michael Giacchino, Joe Kraemer, and Lorne Balfe.\r\rBeginning in 1996, the films (taking place starting six years after the events of the previous TV sequel series) follow the missions of the IMF's main field team under the leadership of Hunt, who is forced to take over after the team is betrayed from within during the first film. The series focuses on Hunt as the lead character as opposed to the ensemble cast structure of the television series, although some characters, such as Luther Stickell (played by Ving Rhames) and Benji Dunn (played by Simon Pegg) have recurring roles in the films.\r\rThe series has received a positive reception from critics and is the 16th-highest-grossing film series of all time, with a worldwide gross of over $3.5 billion to date. The sixth and most recent film, titled Mission: Impossible – Fallout, was released in July 2018, and was written and directed by Christopher McQuarrie.\r\rAll of the Mission: Impossible movies are released by Paramount Pictures and rated PG-13 by the Motion Picture Association of America.",
  "createdAt": {
    "$date": "2019-09-22T04:29:19.790Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T04:29:19.790Z"
  },
  "__v": 0
}
{
  "_id": {
    "$oid": "5d87370640bfcc2b34a07c2c"
  },
  "title": "Even though the final season was disappointing, overall Game of Thrones was an great show",
  "author": {
    "$oid": "5d86f82ed62e132d70a5d3ab"
  },
  "content": "Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss for HBO. It is an adaptation of A Song of Ice and Fire, George R. R. Martin's series of fantasy novels, the first of which is A Game of Thrones. The show was both produced and filmed in Belfast and elsewhere in the United Kingdom. Filming locations also included Canada, Croatia, Iceland, Malta, Morocco, and Spain. The series premiered on HBO in the United States on April 17, 2011, and concluded on May 19, 2019, with 73 episodes broadcast over eight seasons.\r\rSet on the fictional continents of Westeros and Essos, Game of Thrones has several plots and a large ensemble cast and follows several story arcs. One arc is about the Iron Throne of the Seven Kingdoms and follows a web of alliances and conflicts among the noble dynasties either vying to claim the throne or fighting for independence from it. Another focuses on the last descendant of the realm's deposed ruling dynasty, who has been exiled and is plotting a return to the throne, while another story arc follows the Night's Watch, a brotherhood defending the realm against the fierce peoples and legendary creatures of the North.\r\rGame of Thrones attracted a record viewership on HBO and has a broad, active, and international fan base. It was acclaimed by critics for its acting, complex characters, story, scope, and production values, although its frequent use of nudity and violence (including sexual violence) was criticized. The series received 47 Primetime Emmy Awards, the most by a drama series, including Outstanding Drama Series in 2015, 2016, and 2018. Its other awards and nominations include three Hugo Awards for Best Dramatic Presentation (2012–2014), a 2011 Peabody Award, and five nominations for the Golden Globe Award for Best Television Series – Drama (2012 and 2015–2018). In 2019, the show's final season established a new record for most Emmy nominations received in the same year by any show with 32, breaking the 25 years long record of 26 nominations established by NYPD Blue in 1994; it also established Game of Thrones as the drama series with the most overall Emmy nominations, with a total of 161.",
  "createdAt": {
    "$date": "2019-09-22T08:55:34.234Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T08:55:34.234Z"
  },
  "__v": 0
}
{
  "_id": {
    "$oid": "5d87370e40bfcc2b34a07c2d"
  },
  "title": "When it comes to animated shows, Avatar: The Last Airbender is my favourite. Can't wait for the live-action remake of the series",
  "author": {
    "$oid": "5d86f82ed62e132d70a5d3ab"
  },
  "content": "Avatar: The Last Airbender (Avatar: The Legend of Aang in some regions) is an American animated television series created by Bryan Konietzko and Michael Dante DiMartino that aired for three seasons on Nickelodeon. The series began airing in February 2005 and concluded in July 2008. Avatar: The Last Airbender is set in an Asiatic-like world in which some people can manipulate the classical elements with psychokinetic variants of the Chinese martial arts known as 'bending'. The series is presented in a style that combines anime with American cartoons and relies on the imagery of East/South Asian, Inuit, and New World societies. It follows the protagonists, 12-year-old Aang and his friends, who must bring peace and unity to the world by ending the Fire Lord's war with the rest of the world.\r\rThe series was commercially successful and was acclaimed by audiences and critics, who praised its art direction, humor, cultural references, characters, and themes. It was nominated for—and won—Annie Awards, Genesis Awards, a Primetime Emmy Award, and a Peabody Award. The first season's success prompted Nickelodeon to order a second and third season. Merchandising for the series consisted of action figures, a trading card game, three video games, stuffed animals distributed by Paramount Parks, and two Lego sets. An art book was published in June 2010. The complete series was released on Blu-ray on June 5, 2018 for the 10th anniversary of season 3's finale.\r\rThe series inspired a critically panned but financially successful live-action film, The Last Airbender, directed by M. Night Shyamalan and considered one of the worst movies ever made. An animated sequel series, The Legend of Korra, aired from 2012 to 2014. A new live-action remake of the series by its original creators to be produced for Netflix was announced in September 2018.",
  "createdAt": {
    "$date": "2019-09-22T08:55:42.928Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T08:55:42.928Z"
  },
  "__v": 0
}
{
  "_id": {
    "$oid": "5d87372440bfcc2b34a07c2e"
  },
  "title": "Not really into the horror genre or the 80's, but still enjoyed Stranger Things.",
  "author": {
    "$oid": "5d86f82ed62e132d70a5d3ab"
  },
  "content": "Stranger Things is an American science fiction horror web television series created by the Duffer Brothers and released on Netflix. The siblings also serve as executive producers with Shawn Levy and Dan Cohen. The first season stars Winona Ryder, David Harbour, Finn Wolfhard, Millie Bobby Brown, Gaten Matarazzo, Caleb McLaughlin, Natalia Dyer, Charlie Heaton, Cara Buono, and Matthew Modine, with Noah Schnapp and Joe Keery in recurring roles. For the second season, Schnapp and Keery were made series regulars, as were newly cast Sadie Sink, Dacre Montgomery, Sean Astin, and Paul Reiser, with Priah Ferguson appearing in a recurring role. Maya Hawke joined the cast for the third season, while Ferguson was promoted to a series regular.\r\rSet in the fictional town of Hawkins, Indiana, in November 1983, the first season focuses on the investigation into the disappearance of a young boy amid supernatural events occurring around the town, including the appearance of a girl with psychokinetic abilities who helps the missing boy's friends in their search. The second season, titled Stranger Things 2, is set one year later in October 1984 and deals with the characters' attempts to return to normality and the aftermath of the events from the first season. The third season, titled Stranger Things 3, is set in July 1985.\r\rThe Duffer Brothers developed the series as a mix of investigative drama alongside supernatural elements portrayed with childlike sensibilities. They set the series in the 1980s and created an homage to the pop culture of that decade. Several themes and directorial aspects were inspired and aesthetically informed by the works of Steven Spielberg, John Carpenter, and Stephen King, among others, including several films, anime, and video games.\r\rThe first season of eight episodes premiered on Netflix on July 15, 2016. It received critical acclaim for its characterization, pacing, atmosphere, acting, soundtrack, directing, writing, and homages to 1980s films. The second season consisting of nine episodes was released on October 27, 2017. A third season consisting of eight episodes was released on July 4, 2019. The Duffer Brothers have said that Stranger Things is likely to end after its fourth or fifth season. The series has received 31 Primetime Emmy Award nominations, including for Outstanding Drama Series, and four Golden Globe Award nominations, and it won the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series in 2016.",
  "createdAt": {
    "$date": "2019-09-22T08:56:04.584Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T08:56:04.584Z"
  },
  "__v": 0
}
{
  "_id": {
    "$oid": "5d87373840bfcc2b34a07c2f"
  },
  "title": "It was only 13 episodes long but Sherlock was a great tv show. Benedict Cumberbatch's portrayal of Sherlock Holmes is still one of the best, IMO",
  "author": {
    "$oid": "5d86f82ed62e132d70a5d3ab"
  },
  "content": "Sherlock is a British crime drama television series based on Sir Arthur Conan Doyle's Sherlock Holmes detective stories. Created by Steven Moffat and Mark Gatiss, it stars Benedict Cumberbatch as Sherlock Holmes and Martin Freeman as Doctor John Watson. 13 episodes have been produced, with four three-part series airing from 2010 to 2017, and a special episode that aired on 1 January 2016. The series is set in the present day, while the one-off special features a Victorian period fantasy resembling the original Holmes stories. Sherlock is produced by the British network BBC, along with Hartswood Films, with Moffat, Gatiss, Sue Vertue and Rebecca Eaton serving as executive producers. The series is supported by the American station WGBH-TV Boston for its Masterpiece anthology series on PBS, where it also airs in the United States. The series is primarily filmed in Cardiff, Wales, with North Gower Street in London used for exterior shots of Holmes and Watson's 221B Baker Street residence.\r\rSherlock has been praised for the quality of its writing, acting, and direction. It has been nominated for numerous awards including Emmys, BAFTAs and a Golden Globe, winning several awards across a variety of categories. The show won in three categories at the 66th Primetime Emmy Awards including Outstanding Lead Actor in a Miniseries or a Movie for Cumberbatch, Outstanding Supporting Actor in a Miniseries or a Movie for Freeman and Outstanding Writing for a Miniseries, Movie or a Dramatic Special for Moffat. Two years later, it won Outstanding Television Movie. In addition, the show was also honoured with a Peabody Award in 2011.",
  "createdAt": {
    "$date": "2019-09-22T08:56:24.862Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T08:56:24.862Z"
  },
  "__v": 0
}
{
  "_id": {
    "$oid": "5d87f8cb8c73f124706139ec"
  },
  "title": "The Bootstrap Paradox is such a weird time travel concept",
  "author": {
    "$oid": "5d86f882d62e132d70a5d3ad"
  },
  "content": "The Bootstrap Paradox, also known as 'casual loop',  is a theoretical proposition in which, by means of either retrocausality or time travel, a sequence of events (actions, information, objects, people) is among the causes of another event, which is in turn among the causes of the first-mentioned event. Such causally looped events then exist in spacetime, but their origin cannot be determined. A hypothetical example of a causality loop is given of a billiard ball striking its past self: the billiard ball moves in a path towards a time machine, and the future self of the billiard ball emerges from the time machine before its past self enters it, giving its past self a glancing blow, altering the past ball's path and causing it to enter the time machine at an angle that would cause its future self to strike its past self the very glancing blow that altered its path.\r\rYeah, I don't get it either. But there's a prety good Doctor Who episode about it.",
  "createdAt": {
    "$date": "2019-09-22T22:42:19.490Z"
  },
  "updatedAt": {
    "$date": "2019-09-22T22:42:19.490Z"
  },
  "__v": 0
}
